class script(object):  
    START_TXT = """<b>✨ שלום {user}.

שמי {bot}.

אני יכול לספק סרט בשבילך - פשוט הוסף אותי לקבוצה שלך או הצטרף לקבוצתנו</b>"""
    
    HELP_TXT = "היי {}\nהנה העזרה שלי"

    ABOUT_TXT = """<b>✯ שמי: {}
✯ מפתח: <a herf=https://t.me/Mr_MKN>mr.mkn tg</a>
✯ נכתב ב: פייתון/פיירוגרם
✯ מסד הנתונים שלי: MongoDB
✯ השרת שלי: כל מקום
✯ הגרסה שלי: professor-bot v4.5.0</b>"""
   
    SOURCE_TXT = """<b>הערה:</b>
- קוד המקור כאן ◉› :<a href=https://github.com/MrMKN/PROFESSOR-BOT>professor-bot</a>

<b>מפתח: <a herf=https://t.me/Mr_MKN>mr.mkn tg</a></b>"""

    FILE_TXT = """<b>➤ עזרה לאחסון קבצים</b>

<i>באמצעות מודול זה תוכל לאחסן קבצים במסד הנתונים שלי ואקבל עבורך קישור קבוע לגישה לקבצים השמורים. אם ברצונך להוסיף קבצים מערוץ ציבורי – שלח את קישור הקובץ בלבד, או אם ברצונך להוסיף קבצים מערוץ פרטי, עליך להפוך אותי לאדמין בערוץ כדי שאוכל לגשת לקבצים.</i>

<b>⪼ פקודות ושימוש</b>
➪ /link › השב לכל מדיה לקבלת הקישור 
➪ /batch › ליצירת קישור למספר מדיה

<b>⪼ דוגמה:</b>
</code>/batch https://t.me/mkn_bots_updates/1 https://t.me/mkn_bots_updates/10</code>"""
  
    FILTER_TXT = "בחר את מה שאתה רוצה...✨"
    
    GLOBALFILTER_TXT = """<b>עזרה לסינון גלובלי</b>

<i>סינון הוא הפיצ'ר שבו משתמשים יכולים להגדיר תגובות אוטומטיות עבור מילה מסוימת, והבוט יענה כאשר המילה מופיעה בהודעה</i>

<b>הערה:</b>
מודול זה עובד רק עבור האדמינים שלי

<b>פקודות ושימוש:</b>
• /gfilter - להוסיף סינון גלובלי
• /gfilters - לצפייה ברשימת כל הסינונים הגלובליים
• /delg - למחוק סינון גלובלי מסוים
• /delallg - למחוק את כל הסינונים הגלובליים

• /g_filter off - השתמש בפקודה זו עם on/off בקבוצתך לשליטה בסינון הגלובלי בקבוצה"""
    
    MANUELFILTER_TXT = """<b>עזרה לסינונים</b>

<i>סינון הוא הפיצ'ר שבו משתמשים יכולים להגדיר תגובות אוטומטיות עבור מילה מסוימת, והבוט יענה כאשר המילה מופיעה בהודעה</i>

<b>הערה:</b>
1. לבוט זה יש צורך בהרשאות אדמין.
2. רק אדמינים יכולים להוסיף סינונים בצ'אט.
3. כפתורי התראה מוגבלים ל-66 תווים.

<b>פקודות ושימוש:</b>
• /filter - להוסיף סינון בצ'אט
• /filters - רשימת כל הסינונים בצ'אט
• /del - למחוק סינון מסוים בצ'אט
• /delall - למחוק את כל הסינונים בצ'אט (בבעלות בעל הצ'אט)

• /g_filter off - השתמש בפקודה זו עם on/off בקבוצתך לשליטה בסינון הגלובלי בקבוצה"""
    
    BUTTON_TXT = """<b>עזרה לכפתורים</b>

<i>בוט זה תומך בכפתורי URL והתראה בשורה.</i>

<b>הערה:</b>
1. טלגרם לא מאפשר שליחת כפתורים ללא תוכן, לכן התוכן הוא חובה.
2. בוט זה תומך בכפתורים עם כל סוגי המדיה של טלגרם.
3. הכפתורים צריכים להיות מפורשים בפורמט Markdown.

<b>כפתורי URL:</b>
[טקסט כפתור](buttonurl:xxxxxxxxxxxx)

<b>כפתורי התראה:</b>
[טקסט כפתור](buttonalert:זוהי הודעת התראה)"""
    
    AUTOFILTER_TXT = """<b>עזרה לאוטו-סינון</b>

<Ai>אוטו-סינון הוא הפיצ'ר לסינון ואחסון קבצים אוטומטית מערוץ לקבוצה. ניתן להשתמש בפקודות הבאות כדי להפעיל/לכבות את האוטו-סינון בקבוצה שלך</i>

• /autofilter on - הפעל אוטו-סינון בצ'אט שלך
• /autofilter off - השבת אוטו-סינון בצ'אט שלך

<Ob>פקודות נוספות:</b>
• /set_template - הגדר תבנית IMDB עבור הקבוצה שלך 
• /get_template - קבל את תבנית IMDB הנוכחית עבור הקבוצה שלך"""
    
    CONNECTION_TXT = """<b>עזרה לחיבורים</b>

<i>משמש לחיבור הבוט להודעות פרטיות לניהול סינונים. זה עוזר להימנע מספאם בקבוצות</i>

<b>הערה:</b>
• רק אדמינים יכולים להוסיף חיבור.
• שלח /connect כדי לחבר אותי להודעות הפרטיות שלך

<Cb>פקודות ושימוש:</b>
• /connect - חבר צ'אט מסוים להודעות הפרטיות שלך
• /disconnect - נתק מצ'אט
• /connections - הצג את כל החיבורים שלך"""
    
    ADMIN_TXT = """<b>עזרה לאדמינים</b>
    
<i>מודול זה עובד רק עבור האדמינים שלי</i>

<b>פקודות ושימוש:</b>
• /logs - לקבלת הלוגים של השגיאות האחרונות
• /delete - למחוק קובץ מסוים מהמסד
• /deleteall - למחוק את כל הקבצים מהמסד
• /users - לקבלת רשימת המשתמשים וה-ID שלהם
• /chats - לקבלת רשימת הצ'אטים וה-ID שלהם
• /channel - לקבלת רשימת כל הערוצים המחוברים
• /broadcast - לשליחת הודעה לכל המשתמשים
• /group_broadcast - לשליחת הודעה לכל הקבוצות המחוברות
• /leave  - עם ID צ'אט לעזיבה מצ'אט
• /disable  - עם ID צ'אט לכיבוי צ'אט
• /invite - עם ID צ'אט לקבלת קישור ההזמנה לכל צ'אט שבו הבוט אדמין
• /ban_user  - עם ID לאיסור משתמש
• /unban_user  - עם ID לשחרור חסימת משתמש
• /restart - לאתחול הבוט
• /clear_junk - למחיקת כל החשבונות והחשבונות החסומים מהמסד
• /clear_junk_group - למחיקת/להסרת קבוצות שהוסרו או שהושבתו מהמסד"""
    
    STATUS_TXT = """<b>◉ סך כל הקבצים: <code>{}</code>
◉ סך כל המשתמשים: <code>{}</code>  
◉ סך כל הצ'אטים: <code>{}</code>
◉ גודל מסד הנתונים בשימוש: <code>{}</code>
◉ גודל מסד הנתונים הפנוי: <code>{}</code></b>"""

    LOG_TEXT_G = """<b>#קבוצה_חדשה

◉ קבוצה: {a}
◉ קבוצה-ID: <code>{b}</code>
◉ קישור: @{c}
◉ חברים: <code>{d}</code>
◉ נוספה על ידי: {e}

◉ על ידי: @{f}</b>"""
  
    LOG_TEXT_P = """#משתמש_חדש
    
◉ מזהה משתמש: <code>{}</code>
◉ שם חשבון: {}
◉ שם משתמש: @{}

◉ על ידי: @{}</b>"""
  
    GROUPMANAGER_TXT = """<b>עזרה למנהל קבוצה</b>

<i>זו עזרה לניהול הקבוצה שלך. פקודות אלו יעבדו רק עבור אדמיני הקבוצה</i>

<b>פקודות ושימוש:</b>
• /inkick - פקודה שתוציא חברים מהקבוצה.
• /instatus - לבדוק את מצב חברי הקבוצה.
• /dkick - להוציא חשבונות שנמחקו.
• /ban - לאסור משתמש מהקבוצה.
• /unban - לשחרר חסימת משתמש.
• /tban - לאסור משתמש באופן זמני.
• /mute - להשתיק משתמש.
• /unmute - לבטל השתקה של משתמש.
• /tmute - עם ערך, להשתיק עד לזמן מסוים לדוגמה: <code>/tmute 2h</code> כדי להשתיק למשך 2 שעות (m/h/d)
• /pin - להדביק הודעה בצ'אט שלך.
• /unpin - להסיר את ההדבקה מהודעה בצ'אט שלך.
• /purge - למחוק את כל ההודעות מההודעה שהושבה כתגובה, עד להודעה הנוכחית"""
    
    EXTRAMOD_TXT = """<b>עזרה למודול נוסף</b>

<i>פשוט שלח כל תמונה לעריכה ✨</i>

<b>פקודות ושימוש:</b>
• /id - לקבלת מזהה משתמש מסוים
• /info  - לקבלת מידע אודות משתמש
• /imdb  - לקבלת מידע על הסרט ממקור IMDB
• /paste [טקסט] - להדביק את הטקסט הנתון באתר Pastey
• /tts [טקסט] - להמיר טקסט לדיבור
• /telegraph - שלח פקודה זו כתגובה עם תמונה או וידאו מתחת (5MB)
• /json - השב לכל הודעה כדי לקבל מידע על ההודעה (שימושי לקבוצות)
• /written - השב עם טקסט כדי לקבל קובץ (שימושי למפתחים)
• /carbon - השב עם טקסט כדי לקבל תמונה עם אפקט קארבון
• /font [טקסט] - לשנות את גופן הטקסט שלך לגופן מעוצב
• /share - השב עם טקסט כדי לקבל קישור שיתופי לטקסט
• /song [שם] - לחפש שיר ביוטיוב
• /video [קישור] - להוריד וידאו מיוטיוב"""    
    
    CREATOR_REQUIRED = "❗<b>עליך להיות יוצר הקבוצה כדי לבצע זאת</b>"
      
    INPUT_REQUIRED = "❗ **נדרש ארגומנט**"
      
    KICKED = "✔️ הוצאתי בהצלחה {} חברים בהתאם לארגומנטים שניתנו"
      
    START_KICK = "מסיר חברים לא פעילים – זה עשוי לקחת זמן"
      
    ADMIN_REQUIRED = "❗<b>אני לא אדמין בצ'אט זה, אנא הוסף אותי שוב עם כל הרשאות האדמין</b>"
      
    DKICK = "✔️ הוצאתי {} חשבונות שנמחקו בהצלחה"
      
    FETCHING_INFO = "<b>אנא המתן, אאסוף את כל המידע</b>"
   
    SERVER_STATS = """סטטיסטיקות שרת:
 
זמן פעולה: {}
שימוש CPU: {}%
שימוש RAM: {}%
דיסק כולל: {}
דיסק בשימוש: {} ({}%)
דיסק פנוי: {}"""
    
    BUTTON_LOCK_TEXT = "היי {query}\nזה לא בשבילך. חפש לעצמך"
   
    FORCE_SUB_TEXT = "מצטער, אחי, לא הצטרפת לערוץ שלי. אנא לחץ על כפתור ההצטרפות והנסה שוב"
   
    WELCOM_TEXT = """היי {user} 💞

ברוכים הבאים ל-{chat}.

שתף ותמוך, בקש את הסרטים שתרצה"""
  
    IMDB_TEMPLATE = """<b>שאילתה: {query}</b>

🏷 כותרת: <a href={url}>{title}</a>
🎭 ז'אנרים: {genres}
📆 שנה: <a href={url}/releaseinfo>{year}</a>
🌟 דירוג: <a href={url}/ratings>{rating}</a>/10"""
